app/views/gossips/show.html.erb

          <h5 class="card-title">The gossip '<%= @gossip.title %>'</h5>
          <h6 class="card-subtitle mb-3 text-muted">submitted by <%= @gossip.user.first_name %></h6>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]