app/views/home/index.html.erb

                  <p class="card-text"><%= gossip.title %></p>
                  <p class="card-text"><small class="text-muted">Author: <%= gossip.user.first_name %></small></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]