app/controllers/gossips_controller.rb

   def create
   @gossip = Gossip.new(title: params[:title],content: params[:content],user_id: current_user[:id])

  if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hey"], ["content", "Test"], ["user_id", 20], ["created_at", "2020-02-13 20:28:29.193939"], ["updated_at", "2020-02-13 20:28:29.193939"]]

def edit
  @gossip = Gossip.find(params[:id])
  if current_user.id == @gossip.user.id
    @gossip = Gossip.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]