app/controllers/users_controller.rb

  def show
    @author = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

   def create
    @user = User.new(email: params[:email], password: params[:password], city_id: 1, first_name: params[:first_name], last_name: params[:last_name])

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "city_id", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"